# Pandas

Excel para python, ou R para python

---
### Series


Muito similar de um array do numpy,
Para criarmos uma Serie, utilizamos ```pd.Series(data, index)```

O comando recebe varios argumentos, mas nessas duas opções, podemos organizar os dados por algum index. por exemplo

```labels = ['a','b','c'] ``` Lista

```my_data = [10, 20, 30] ``` Lista

```arr = np.array(my_data)``` Array

```d = {'a':10, 'b':20, 'c':30}``` Dicionario

Utilizando o Series, conseguimos relacionar os elementos, por exemplo

```pd.Series(my_data, labels)```

Retorna
```
a    10
b    20
c    30
dtype: int64
```

Podemos tb passar um array, por já estar indexado, não precisamos indicar um label.

```pd.Series(arr)```

Retorna o mesmo resultado.
Series funcionam de modo muito similar a dicionarios, temos os index e o conteudo desses index.
Quando populamos uma serie com algum conteudo, indicamos o que é label e o que  dado.Dessa forma podemos encontrar o dado especificado apontando apenas para o label.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
pd.Series()

Series([], dtype: float64)

In [4]:
labels = ['a','b','c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [5]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# DataFrames

Começamos populando um data frame, pra isso usamos

``df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) ``


Com isso, e após termos importado o randn do numpy, temos um dataframe que parece bastante com um excel
O que o pandas faz é, mostrar os dados de forma organizada, mas cada coluna é uma serie sozinha, podemos verificar isso com

``df['W']``

Que retorna apenas o conteudo da coluna W, que é uma serie.
Podemos confirmar isso usando o type

``type(df['W'])``

Que retorna  ``pandas.core.series.Series``

Agora, se rodarmos o ``type(df)`` retorna  ``pandas.core.frame.DataFrame``


Ou seja, o que nos é apresentado no dataframe é apenas o conjunto de dados que contem o mesmo index.
Podemos chamar uma coluna usando o ``df.w`` que retorna o conteudo, porem esse metodo não é recomendavel pq o dataframe tem varios metodos que podem ser usados e chamar o dataframe.index pode causar problemas
Se quiseremos duas colunas, precisamos passar uma lista nos argumentos

``df[['W','Z']]``

Que vai resultar nas duas colunas, um dataframe ao contrario de uma serie

Nos DataFrames, as colunas são o eixo 1 e as linhas são o eixo 0

---

### Operações com Colunas

#### Nova Coluna
Se quisermos inserir uma nova coluna, podemos usar o metodo 

``df['soma'] = df['W'] + df['Y']``

Depois chamarmos o dataframe inteiro vai apresentar a nova coluna, preenchida com os elementos somados, linha por linha.

#### Remover Coluna

``df.drop('soma', axis=1, inplace=True)``

Remove a coluna soma, o argumento inplace é uma especie de confirmação, para evitar que seja perdido dados por acidente
Se quisermos remover uma linha podemos usar o mesmo argumento, deixando o axis em branco, pq o valor padrão é zero.

---

### Retornar uma linha


``df.loc['A']``

Podemos chamar uma linha inteira pelo index dela com a função loc.
Quando fazemos isso podemos notar que os index das colunas são series tb
Podemos usar o iloc tambem, que funciona sem usar o nome da index, o que é mais recomendado

``df.iloc[2]`` 

Retorna o mesmo que se usarmos

``df.loc['C']``

Se quisermos um elemento especifico, utilizamos dois argumentos, primeiro para a linha depois para a coluna

In [8]:
from numpy.random import randn

In [9]:
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df['soma'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z      soma
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

# DataFrames pt2


Podemos trabalhar o dataframe com operadores de comparação,
Por exemplo, partindo do dataframe anterior, se quisermos ver quem é menor que zero poder usar o seguinte

`` df > 0 ``

Que o dataframe retorna os valores em resultado boleanos
Para podermos retornar os valores que resultando em determinada condição, podemos usar a operação dentro de ``[ ]`` , Por exemplo

`` df[df > 0 ]``

Que nos retorna os valores onde a condição é respeitada, onde a condição não é verdadeira, é retornado como nulo.
Esse tipo de operação não é normalmente utilizada para um dataframe inteiro, o que se faz é passar um coluna ou uma linha, e dessa forma retorna apenas os valores que atendem as condições.

Partindo da coluna W, vamos verificar quais valores são maiores que zero usando ``df['W']>0``
O que nos retorna é uma serie, resultados booleanos, podemos agora passar o resto do dataframe para podermos ficar apenas com os valores que atendem essa condições

``df[df['W']>0]``

Podemos ver que a linha C não consta, pois na coluna W o valor no CW é menor que zero

O resultado dessas operações são dataframes, podemos armazenar o resultado em variaveis e realizar operações com eles posteriormente.
Além disso, podemos realizar operações diretamente, por exemplo

``df[df['W']>0]['X']`` 

Primeiro procuramos no df qual das linhas em W que são maiores que zero, desse resultado, pegamos apenas a coluna X, o que resulta em uma series
Da mesma forma, podemos passar uma lista e retornar duas colunas 

``df[df['W']>0][['X','Y']]`` 


### Multiplas condições

O pensamento logico na hora de tentar executar multiplas condições seria usar o operador ``and`` mas ele não funciona para series.
Usamos o operador ``&`` que permite que a gente faça multiplas condições, por exemplo

``df[(df['W']>0) & (df['Y']>1)]``

Aqui queremos que seja mostrados os valores que em w sejam maior que 0 e em y sejam maiores que 1

A notação é sempre essa.
Essa operação é a equivalente ao `` and ``
Para usarmos o ``or `` usamos o pipe ``|``


---

``'Alguma String.split()`` podemos gerar uma lista com os elementos da string, separados por um espaço por exemplo

---

### Index

Se quisermos definir algum elemento como index, podemos utilizar o comando ``df.set_index('coluna') ``
Dessa forma o conteudo da coluna em questão vai sobreescrever o conteudo do index atual
Para zerar o index, utilizamos a função ``df.reset_index()`` , que move a coluna do index pro lado e coloca uma listagem de numero crescentes no lugar.

In [18]:
df > 0

       W      X      Y      Z   soma
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [19]:
df[df>0]

          W         X         Y         Z      soma
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [20]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [21]:
df[df['W']>0]

          W         X         Y         Z      soma
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [23]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [24]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z      soma
E  0.190794  1.978757  2.605967  0.683509  2.796762

## Dataframes PT3 

Podemos ter varios niveis de index, podemos adicionar quantas camadas quisermos
Quando for esse o caso, trabalhamos de fora pra dentro por exemplo

``df.loc['G1'].loc[1]``

Dessa forma primeiro pegamos o grupo maior e desse grupo maior selecionamos a coluna que desejamos ver.

Quando chamamos o dataframe inteiro, podemos notar que não temos, podemos adicionar titulos aos index para facilitar na compreensão do que ta sendo tabelado
Nessa situação utilizamos

``df.index.names = ['Grupos', 'Num']``

Que nomeou o primeiro index como grupos e o segundo como num.

O metodo de seleção pode ser o quao especifico for necessario, 
Por exemplo, se quiseremos pegar o elemento  que se encontrar na coluna B, do numero 2 do grupo G2, usamos o seguinte:

``df.loc['G2'].loc[2]['B']`` 

Indo do maior grupo para o menor

### CrossSection

Essa função nos permite retornar valores que pelo ``loc`` seria mais complicado de conseguirmos pegar.


``df.xs(1,level='Num')``

Por exemplo nessa situação, pegamos todos os elementos que no index ``Num`` são iguais a ``1``
Conseguiriamos fazer isso com o ``loc`` mas seria bem mais complicado

In [25]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [26]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [27]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [28]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [29]:
df.index.names = ['Grupos', 'Num']

In [30]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [31]:
df.xs(1,level='Num')

               A         B
Grupos
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

quando estamos trabalhando em cima de um dataframe e encontramos dados faltando, podemos resolver da seguinte forma

Partindo de ``df`` populado, com alguns elementos faltando.
Se quisermos desconsiderar todos as linhas que estão com elementos em branco utilizamos

``df.dropna()``

Dessa forma vai sobrar apenas as linhas que contem todos os elementos.
Caso desejamos que seja feito nas colunas, alteramos o eixo para ``1`` 

``df.dropna(axis=1)``

Dessa forma todas as colunas que tiverem elemento faltando serão descondediradas.
Podemos alterar tb o ``tresh`` de forma que seja adicionado alguma tolerancia, por exemplo

``df.dropna(tresh=2)``

Onde todos as linhas que tenham 2 elementos nulos são desconsideradas.

---

Podemos tb preencher os elementos que estão vazios, por exemplo

``df.fillna(value='Preencher')``

Nessa situação alteramos o texto que fica presente nos elementos vazios com a palavras ``Preencher``

Além disso, podemos tb preencher com a média dos elementos, por exemplo

``df['A'].fillna(value=df['A'].mean())``

Nessa situação estamos preeenchendo o dado em branco da coluna ``A`` com a média dos elementos que tem na coluna.
Tem que ver os dados que tem na coluna para usar essa função

In [32]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [35]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [36]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [37]:
df.fillna(value='Preencher')

           A          B  C
0          1          5  1
1          2  Preencher  2
2  Preencher  Preencher  3

In [38]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

A função GroupBy funciona similar com a do SQL, 
Vai unir valores baseado em algum elemento em comum com todos.

Partindo do dataframe preenchido,
Utilizamos o comando ``df.groupby('Index')`` 
Isso faz com que seja agrupado pelo index que desejamos, utilizamos o company
A função retorna o local de memoria que ficou armazenado, não um dataframe.
Podemos armazenar esse dado em uma variavel e usar funções em cima pra podermos retirar dados desse data frame.

Por exemplo

``df.groupby('Company').sum()``

Retorna um dataframe com a soma dos salarios agrupados por empresa.


``df.groupby('Company').mean().loc['FB']``

Dessa forma, conseguimos agrupar pela empresa, encontrar a media salarial e retornar apenas os valores da empresa FB

Vale salientar que esse operadores matematicos ignoram os nomes das pessoas, por ser String ele não realiza nenhuma operação com eles, porem
Se usar o metodo 

``df.groupby('Company').count()``

Retorna a soma dos elementos, uma vez que ele só precisar existir, não importa o que preenchimento.

Além do ``count()`` podemos utilizar os metodos ``max `` e ``min`` , para retornarmos os maiores valores e os menores.
Vale salientar que esses metodos operam na primeira coluna, nessa situação, apenas trabalhando em cima da ordem alfabetica

Outra função interessante é o ``.describe`` que retorna um monte de informação sobre os numeros que preenchem o dicionario.

In [39]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [40]:
df = pd.DataFrame(data)

In [41]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [42]:
df.groupby('Company')

In [43]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [44]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [45]:
df.groupby('Company').mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [46]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [47]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [48]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging Joining and Concatenating

### Concatenation

Basicamente unir dois dataframes juntos

Usamos o comando ``pd.concat([df1,df2,df3])`` passando como argumento uma lista com os dataframes que queremos concatenar
O comando parte do principio que o eixo que estamos concatenando é o eixo vertical, podemos passar como argumento o eixo vertical ficando da seguinte forma ``pd.concat([df1,df2,df3], axis=1)`` , resultando na concatenação horizontal. Nessa situação, podemos notar que não temos dados para os os pontos do dataframe, e por isso temos os elementos vazios.

### Merging

Da mesma forma que no SQL, partimos de uma coluna em comum e unimos dois dataframes,

utilizando a função ``pd.merge(left,righ,how='inner', on='key')`` 
Temos a coluna que vai ficar na esquerda, a que vai ficar na direita, a forma que vai ser feito o merging e qual a coluna que temos em comum nas duas dataframes, no on, podemos ter mais de uma coluna


### Joining

A mesma ideia que o merge, porem ao inves de termos uma coluna com os elementos em comum, temos o index como elemento em comum
Por exemplo, temos os dois dataframes ``left`` e ``right`` .
Utilizamos a função ``.join()`` na que desejamos unir com a outra, ficando por exemplo

``left.join(right)`` 

Da mesma forma que o merge, temos o parametro ``how=`` , onde podemos colocar a forma que sera feito.

#### Concatenation
---

In [49]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [50]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [51]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [52]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [53]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [54]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
---

In [55]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [56]:
pd.merge(left,right,how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Joining
---

In [57]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [58]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [59]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## Operations
 
Para encontrarmos valores unicos em determinada coluna podemos utilizar a função ``.unique()`` , que retorna os valores unicos da coluna.
Agora, se quisermos apenas a quantidade de dados unidos que temos, existem dois metodos

``len(df['col2'].unique())``  que retorna apenas a quantidade de elementos no dataframe, 
ou podemos usar a função do pandas
``df['col2'].nunique()`` que o resultado é o mesmo

Se quiseremos saber quantas vezes cada elemento aparece, utilizamos a função ``.value_conts()`` , por exemplo

``df['col2'].value_counts()``

Nos retorna um dataframe com os valores unicos e a quantidade de vezes que ele aparece na coluna

---

Se quisermos usar uma função propria em todos os elementos de determinada coluna em um dataframe, o pandas possue a função ``.apply()`` . Por exemplo, criamos uma função que multiplica os elementos por 2.
    ``def times2(x):
        return x*2 ``
        
Agora, se quisermos aplicar isso no dataframe,  usamos o apply da seguinte forma
``df['col1'].apply(times2)``

E o pandas vai rodar a função em cada elemento da coluna.
Podemos utilizar funções lambda no apply tb

---

Para ordenarmos o dataframe de acordo com alguma coluna especifica, podemos utilizar ``df.sort_values(by='col2')`` nessa situação por exemplo iremos ordenar o dataframe pela col2. Vale salientar que todo o dataframe ira seguir essa ordem, index inclusos

---

Se quisermos encontrar os elemenots nulos no dataframe podemos utilizar o metodo ``df.isnull()``


---

In [60]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
df['col2'].unique()

array([444, 555, 666])

In [62]:
len(df['col2'].unique())

3

In [63]:
df['col2'].nunique()

3

In [64]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [65]:
def times2(x):
        return x*2

In [66]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [69]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

---
## Como ler e Escrever arquivos

Começamos nos movimentando até a pasta onde os arquivos estão, podemos fazer isso diretamente nas celular do jupyter.
Pra saber em qual pasta estamos usamos o PWD
e usamos o cd para entrarmos na pasta que desejamos

---

Para lermos CSV

Usamos o comando ``pd.read_csv('')`` 
Usando o comando, podemos visualizar o arquivo csv como um dataframe.
A dica nessas situações que queremos ler determinado tipo de arquivo é, ``pd.read_`` e apertamos a tecla tab, o jupyter retorna os formatos que o programa aceita

---

Se quisermos, podemos salvar o arquivo que foi lido em uma variavel com
`` df = pd.read_csv('arquivo.csv')`` 


---
Se quisermos salvar o arquivo em outro formato usamos a função
``pd.to_formato('nome_do_arquivo', index=False')``

É importante colocarmos que o index é falso, uma vez que ele vai ser salvo como uma coluna que faz parte do arquivo.

---

### Arquivos do Excel

O pandas consegue trabalhar com os dados do excel, formatações e formulas não funcionam e podem fazer o pandas travar
Importamos o arquivo do excel, especificando a planilha que desejamos importantar com a função

`` pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1') ``

Caso o arquivo do excel esteja em outra pasta, precisamos declarar todo o caminho

---

Da mesma forma, se quisermos salvar os arquivos para excel, usamos a função

``.to_excel('Excel_sample2.xlsx', sheet_name='newSheet')``

---

### Arquivo HTML

``pd.read_html('link.html')``

Aqui talvez o pandas salve o conteudo dentro de uma lista

---

### Arquivo SQL

``from sqlalchemy import create_engine``

Não é mt recomendado fazer isso com o pandas

In [75]:
pwd

'/mnt/Lucas/Data/__jupyter/03-Python-for-Data-Analysis-Pandas'

In [80]:
pd.read_csv('example')
# Aqui deu  certo pq estamos executando o pandas na pasta onde o arquivo example ta localizado

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [81]:
pd.read_

AttributeError: module 'pandas' has no attribute 'read_'

In [82]:
df = pd.read_csv('example')

In [83]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [84]:
df.to_csv('my_output', index = False)

In [85]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [87]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [90]:
df.to_excel('Excel_sample2.xlsx', sheet_name='newSheet')

In [91]:
from sqlalchemy import create_engine

In [92]:
engine = create_engine('sqlite:///:memory:')

In [93]:
df.to_sql('my_table', engine )

In [94]:
sqldf = pd.read_sql('my_table', con=engine)

In [95]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15